### <font color="brown">Movies Database</font>

---

The movies data has been sourced from: https://data.world/jamesgaskin/movies/workspace/file?filename=view

This dataset has a bunch of columns, of which we are going to only use title (Column B), release_date (Column F), and genre (Column G)

The downloaded data file is in movies_full.xlsx, from which the required columns were extracted into a tab-delimited text file, movies.txt.

For our movies database, we're going to create a **movies** table, a **user** table, and a **rating** table.

---

#### <font color="brown">Create a Movies Database</font>

##### **1. Create a database named <tt>movies</tt>**

##### Execute the following commands in the MySQL client window to create the 'movies' database, and grant permissions to your non-root user

<pre>
    sesh> mysql -u root -p mysql
   
    mysql> create database movies;
    mysql> grant all on movies.* to 'sesh'@'localhost';
    mysql> exit
</pre>

##### **2. Create the 'movie' table**

<pre>
sesh> mysql -u sesh -p movies

mysql> create table movie (
          id int auto_increment primary key, 
          title varchar(100) not null, 
          release_date date not null, 
          genre varchar(20) not null);
</pre>
We could make this table more robust by defining the (title,release_date) combination to be unique:
<pre>
mysql> alter table movie add unique(title,release_date);

mysql> desc movie;
+--------------+--------------+------+-----+---------+----------------+
| Field        | Type         | Null | Key | Default | Extra          |
+--------------+--------------+------+-----+---------+----------------+
| id           | int          | NO   | PRI | NULL    | auto_increment |
| title        | varchar(100) | NO   | MUL | NULL    |                |
| release_date | date         | NO   |     | NULL    |                |
| genre        | varchar(20)  | NO   |     | NULL    |                |
+--------------+--------------+------+-----+---------+----------------+
4 rows in set (0.00 sec)

mysql> show create table movie\G;
*************************** 1. row ***************************
       Table: movie
Create Table: CREATE TABLE `movie` (
  `id` int NOT NULL AUTO_INCREMENT,
  `title` varchar(100) NOT NULL,
  `release_date` date NOT NULL,
  `genre` varchar(20) NOT NULL,
  PRIMARY KEY (`id`),
  UNIQUE KEY `title` (`title`,`release_date`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci
1 row in set (0.00 sec)
</pre>

You can add the same title multiple times, but the (title,release_date) may not be repeated:
<pre>
mysql> insert into movie (title,release_date,genre) values ('ma','2009-12-10','Action');
mysql> insert into movie (title,release_date,genre) values ('ma','2010-12-10','Adventure');
mysql> select * from movie;
+----+-------+--------------+-----------+
| id | title | release_date | genre     |
+----+-------+--------------+-----------+
|  1 | ma    | 2009-12-10   | Action    |
|  2 | ma    | 2010-12-10   | Adventure |
+----+-------+--------------+-----------+
<font color="red">
mysql> insert into movie (title,release_date,genre) values ('ma','2009-12-10','Drama');
ERROR 1062 (23000): Duplicate entry 'ma-2009-12-10' for key 'movie.title'
</font>
</pre>
**Let's drop the movies table and recreate it so that we are can start with id=1 for insertions**
<pre>
mysql> drop table movie;
mysql> create table movie (
          id int auto_increment primary key, 
          title varchar(100) not null, 
          release_date date not null, 
          genre varchar(20) not null,
          unique (title,release_date));
</pre>

##### **3. Create the 'user' table**

In [24]:
states = ["Alabama",
        "Alaska",
        "Arizona",
        "Arkansas",
        "California",
        "Colorado",
        "Connecticut",
        "Delaware",
        "Florida",
        "Georgia",
        "Hawaii",
        "Idaho",
        "Illinois",
        "Indiana",
        "Iowa",
        "Kansas",
        "Kentucky",
        "Louisiana",
        "Maine",
        "Maryland",
        "Massachusetts",
        "Michigan",
        "Minnesota",
        "Mississippi",
        "Missouri",
        "Montana",
        "Nebraska",
        "Nevada",
        "New Hampshire",
        "New Jersey",
        "New Mexico",
        "New York",
        "North Carolina",
        "North Dakota",
        "Ohio",
        "Oklahoma",
        "Oregon",
        "Pennsylvania",
        "Rhode Island",
        "South Carolina",
        "South Dakota",
        "Tennessee",
        "Texas",
        "Utah",
        "Vermont",
        "Virginia",
        "Washington",
        "West Virginia",
        "Wisconsin",
        "Wyoming"]

In [25]:
len(states)

50

In [26]:
max([len(s) for s in states])  # this informs the length of the state column in user table

14

<pre>
mysql> create table user (
          id int auto_increment primary key,
          uname char(8) unique not null, 
          age tinyint not null, 
          state varchar(14) not null);
</pre>

##### **4. Create the 'rating' table**

<pre>
mysql> create table rating (
          userid int not null, 
          foreign key (userid) references user(id),
          movieid int not null, 
          foreign key (movieid) references movie(id),
          unique(userid, movieid),
          rating tinyint not null check (rating >= 0 and rating &lt;= 10));         
</pre>
The CHECK constraints establishes a condition the values of a column. <br>
See https://dev.mysql.com/doc/refman/8.0/en/create-table-check-constraints.html

<pre>
mysql> show create table rating\G;
*************************** 1. row ***************************
       Table: rating
Create Table: CREATE TABLE `rating` (
  `userid` int NOT NULL,
  `movieid` int NOT NULL,
  `rating` tinyint NOT NULL,
  UNIQUE KEY `userid` (`userid`,`movieid`),
  KEY `movieid` (`movieid`),
  CONSTRAINT `rating_ibfk_1` FOREIGN KEY (`userid`) REFERENCES `user` (`id`),
  CONSTRAINT `rating_ibfk_2` FOREIGN KEY (`movieid`) REFERENCES `movie` (`id`),
  CONSTRAINT `rating_chk_1` CHECK (((`rating` >= 0) and (`rating` &lt;= 10)))
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci
1 row in set (0.00 sec)

<font color="red">
mysql> insert into rating values (1,1,15);
ERROR 3819 (HY000): Check constraint 'rating_chk_1' is violated.
</font>
</pre>

---

#### <font color="brown">Connect to movies database</font>

In [1]:
# import connector module
import mysql.connector

In [2]:
# connect to nobels database
mydb = mysql.connector.connect(
  host="localhost",
  user="sesh",
  passwd="sesh",  # replace with your password
  database="movies"
)

In [3]:
# set up for access
cursor = mydb.cursor()

---

#### <font color="brown">Populate the tables</font>

##### **1. Insert into movie table from movies.txt**

In [4]:
add_movie = "insert into movie (title,release_date,genre) values (%s,%s,%s)"

In [5]:
# read text file and strip the double quotes from the title
# also, convert date from month/date/year to year/month/date for db date type
import csv
with open("movies.txt") as infile:
    reader = csv.reader(infile,delimiter='\t')
    for row in reader:
        title = row[0].strip('"')  # a few of the movie titles have double quotes around them
        date_parts = row[1].split('/')
        release_date = date_parts[2] + '/' + date_parts[0] + '/' + date_parts[1] # need year/month/day
        genre = row[2]
        cursor.execute(add_movie,(title,release_date,genre))
        mydb.commit()

##### **The movies_db.txt file has 615 records**

In [12]:
cursor.execute('select count(*) from movie')
res = cursor.fetchall();
for row in res:
    print(row)

(615,)

In [13]:
cursor.execute('select * from movie limit 5')
res = cursor.fetchall();
for row in res:
    print(row)

(1, "Look Who's Talking", datetime.date(1989, 10, 12), 'Romance')
(2, 'Driving Miss Daisy', datetime.date(1989, 12, 13), 'Comedy')
(3, 'Turner & Hooch', datetime.date(1989, 7, 28), 'Crime')
(4, 'Born on the Fourth of July', datetime.date(1989, 12, 20), 'War')
(5, 'Field of Dreams', datetime.date(1989, 4, 21), 'Drama')

In [18]:
# getting year, month, and day fields from release date
# look up datetime module and datetime.date class in Python reference
for row in res:
    (id,title,rdate,genre) = row
    rdate = str(rdate.year) + '/' + str(rdate.month) + '/' + str(rdate.day)
    print((id,title,rdate,genre))

(1, "Look Who's Talking", '1989/10/12', 'Romance')
(2, 'Driving Miss Daisy', '1989/12/13', 'Comedy')
(3, 'Turner & Hooch', '1989/7/28', 'Crime')
(4, 'Born on the Fourth of July', '1989/12/20', 'War')
(5, 'Field of Dreams', '1989/4/21', 'Drama')

---

##### **2. Insert into user table**

&lt;uname> &lt;age> &lt;state>

- The uname column is a randomly generated username with 5 letters and 3 digits
- Age is randomly generated, between 18 and 70
- State is one of the US states, randomly chosen

In [28]:
import string, random, numpy as np
letters = [l for l in string.ascii_letters]  # all lowercase letters, followed by all uppercase letters

In [33]:
# generate username, age, and state
def make_user():
    part1 = ''.join(np.random.choice(letters,5,replace=False).tolist())
    part2 = np.random.randint(0,10,3).tolist()
    part2 = ''.join([str(d) for d in part2])
    uname = part1+part2
    age = random.randint(18,71)
    state = random.choice(states)
    return (uname,age,state)

In [34]:
add_user = "insert into user (uname,age,state) values (%s,%s,%s)"

In [35]:
# insert 2000 rows in user table with unique uname
uset = set()  # make sure there are no duplicate usernames
i = 0
while i < 2000:
    user = make_user()
    if not user[0] in uset:
        uset.add(user)
        cursor.execute(add_user,user)
        mydb.commit()
        i += 1

In [36]:
cursor.execute('select count(*) from user')
res = cursor.fetchall();
for row in res:
    print(row)

(2000,)

In [4]:
cursor.execute('select * from user limit 5')
res = cursor.fetchall();
for row in res:
    print(row)

(1, 'ZqkCe579', 19, 'Delaware')
(2, 'ktFAM702', 53, 'North Carolina')
(3, 'NeOEI446', 35, 'Delaware')
(4, 'DvXQj522', 68, 'Ohio')
(5, 'OVnAt417', 31, 'Ohio')

**Note, your result will be different since user names are randomized**

---

##### **3. Insert into rating table**

Randomly generate a userid (between 1 and 2000, for id values in user table), a movieid (between 1 and 615, for id values in movie table), and a rating (integer between 1 and 10).

In [48]:
add_rating = "insert into rating (userid,movieid,rating) values (%s,%s,%s)"

**Insert 100000 ratings. This will take a little time, so make sure the following cell finishes executing before you check the database**

In [50]:
# insert 100000 ratings 

import random

ratings = {}
i = 0
while i < 100000:
    userid = random.randint(1,2000)
    movieid = random.randint(1,615)
    if (userid,movieid) in ratings: # user has already rated this movie
        continue
    rating = random.randint(1,10)
    ratings[(userid,movieid)] = rating
    cursor.execute(add_rating,(userid,movieid,rating))
    mydb.commit()
    i += 1

In [51]:
cursor.execute('select count(*) from rating')
res = cursor.fetchall();
for row in res:
    print(row)

(100000,)

In [5]:
cursor.execute('select * from rating limit 5')
res = cursor.fetchall();
for row in res:
    print(row)

(1, 1, 7)
(1, 21, 3)
(1, 27, 3)
(1, 63, 9)
(1, 67, 4)

**Note, your result will be different since ratings are randomized**

In [38]:
cursor.close()
mydb.close()

---

#### <font color="brown">Queries</font>

##### **The schema**

<pre>
mysql> desc movie;
+--------------+--------------+------+-----+---------+----------------+
| Field        | Type         | Null | Key | Default | Extra          |
+--------------+--------------+------+-----+---------+----------------+
| id           | int          | NO   | PRI | NULL    | auto_increment |
| title        | varchar(100) | NO   | MUL | NULL    |                |
| release_date | date         | NO   |     | NULL    |                |
| genre        | varchar(20)  | NO   |     | NULL    |                |
+--------------+--------------+------+-----+---------+----------------+
4 rows in set (0.00 sec)

mysql> desc user;
+-------+-------------+------+-----+---------+----------------+
| Field | Type        | Null | Key | Default | Extra          |
+-------+-------------+------+-----+---------+----------------+
| id    | int         | NO   | PRI | NULL    | auto_increment |
| uname | char(8)     | NO   | UNI | NULL    |                |
| age   | tinyint     | NO   |     | NULL    |                |
| state | varchar(14) | NO   |     | NULL    |                |
+-------+-------------+------+-----+---------+----------------+
4 rows in set (0.00 sec)

mysql> desc rating;
+---------+---------+------+-----+---------+-------+
| Field   | Type    | Null | Key | Default | Extra |
+---------+---------+------+-----+---------+-------+
| userid  | int     | NO   | PRI | NULL    |       |
| movieid | int     | NO   | PRI | NULL    |       |
| rating  | tinyint | NO   |     | NULL    |       |
+---------+---------+------+-----+---------+-------+
3 rows in set (0.00 sec)

</pre>
**Your results will be different for queries that involve usernames or ratings since these were randomly generated. <p>
If you want to match results with the ones shown here, you must use the notes_movies.sql database posted in Lectures -> Week of April 26**

**<font color="brown">1. Find movie titles that begin with 'The', limit to 10</font>**

<pre>
mysql> select title from movie where title like 'The%' limit 10;

+--------------------------+
| title                    |
+--------------------------+
| The 40 Year Old Virgin   |
| The Addams Family        |
| The Amazing Spider-Man   |
| The Amazing Spider-Man 2 |
| The Avengers             |
| The Birdcage             |
| The Blair Witch Project  |
| The Blind Side           |
| The Bodyguard            |
| The Boss Baby            |
+--------------------------+
</pre>

---

**<font color="brown">2. How many movies were released in 2015?**

<pre>
mysql> select count(*) from movie where release_date like '2015%';

+----------+
| count(*) |
+----------+
|       20 |
+----------+
</pre>
Alternatively:
<pre>
mysql> select count(*) from movie where year(release_date) = 2015;

+----------+
| count(*) |
+----------+
|       20 |
+----------+
</pre>
https://dev.mysql.com/doc/refman/8.0/en/date-and-time-functions.html

---

**<font color="brown">3. How many movies were released in the years 2001 to 2005?**

<pre>
mysql> select count(*) from movie where year(release_date) between 2001 and 2005;

+----------+
| count(*) |
+----------+
|      100 |
+----------+
</pre>

---

**<font color="brown">4. What are all the movie genres?**

<pre>
mysql> select distinct(genre) from movie;

+-----------------+
| genre           |
+-----------------+
| Romance         |
| Comedy          |
| Crime           |
| War             |
| Drama           |
| Family          |
| Action          |
| Animation       |
| Science Fiction |
| Adventure       |
| Thriller        |
| Western         |
| Horror          |
| Mystery         |
| History         |
| Fantasy         |
+-----------------+
</pre>

---

**<font color="brown">5. Which 3 genres had the most releases in 2010?**

<pre>
mysql> select genre, count(*) as 'number of releases' 
       from movie 
       where year(release_date) = 2010 
       group by genre 
       order by count(*) desc limit 3;
       
+-----------+--------------------+
| genre     | number of releases |
+-----------+--------------------+
| Animation |                  6 |
| Action    |                  3 |
| Drama     |                  2 |
+-----------+--------------------+
</pre>

Tie for #3 broken arbitrarily

---

**<font color="brown">6. List all genres that had at least 3 releases in 2010**

<pre>
mysql> select genre, count(*) as 'number of releases' 
         from movie 
         where year(release_date) = 2010 
         group by genre 
         having count(*) > 2;
         
+-----------+-----+
| genre     | num |
+-----------+-----+
| Action    |   3 |
| Animation |   6 |
+-----------+-----+
</pre>

---

**<font color="brown">7. What were the 5 highest rated movies of 2017, and what were their average rating?**

<pre>
mysql> select title, round(avg(rating),1) as average_rating 
         from rating, movie 
         where movieid=id and year(release_date) = 2017 
         group by movieid 
         order by average_rating desc 
         limit 5;
         
+------------------------+----------------+
| title                  | average_rating |
+------------------------+----------------+
| Beauty and the Beast   |            5.8 |
| Dunkirk                |            5.8 |
| The LEGO Batman Movie  |            5.7 |
| It                     |            5.6 |
| Spider-Man: Homecoming |            5.6 |
+------------------------+----------------+
</pre>
See https://dev.mysql.com/doc/refman/8.0/en/aggregate-functions.html for various aggregate functions (aside from avg)<br>
See https://dev.mysql.com/doc/refman/8.0/en/mathematical-functions.html for various mathematical functions (aside from round)

---

**<font color="brown">8. Which users have an average rating of at least 8.0 for movies in the years 2010-2015, and what is their average rating</font>**

<pre>
mysql> select uname, round(avg(rating),1) as average_rating 
         from rating, user, movie 
         where userid=user.id and 
               movieid=movie.id and 
               year(release_date) between 2010 and 2015 
         group by uname 
         having average_rating >= 8.0;
         
+----------+----------------+
| uname    | average_rating |
+----------+----------------+
| bdZWY381 |            8.2 |
| DQtdi052 |            8.0 |
| ePuFV640 |            8.0 |
| haBkx803 |            8.1 |
| QSJUb581 |            8.2 |
| TdMcx810 |            8.0 |
| tvdUE823 |            8.3 |
| vEraH377 |            8.1 |
| VLUPZ650 |            8.3 |
| vqXGj062 |            8.0 |
| yVIBT711 |            8.4 |
+----------+----------------+
</pre>

**Just out of curiosity, what ratings did yVIBT711 give to these movies?**

<pre>
mysql> select title,rating 
         from movie,rating,user 
         where uname='yVIBT711' and 
               userid=user.id and 
               movieid=movie.id and 
               year(release_date) between 2010 and 2015;

+-------------------------------------------+--------+
| title                                     | rating |
+-------------------------------------------+--------+
| The Twilight Saga: Eclipse                |      6 |
| The Twilight Saga: Breaking Dawn - Part 2 |     10 |
| Madagascar 3: Europe's Most Wanted        |     10 |
| The Croods                                |      5 |
| Godzilla                                  |     10 |
| Interstellar                              |      9 |
| The Amazing Spider-Man 2                  |      9 |
+-------------------------------------------+--------+
</pre>

---

**<font color="brown">9. Which movies (list title and average rating) released in the same year as 'Wonder Woman' have an average rating greater than it?</font>**

<pre>
mysql> select title, year(release_date) as year, avg(rating) as average_rating
             from movie, user, rating
             where userid=user.id 
                   and movieid=movie.id
             group by title, year 
             having year in (select year(release_date) from movie where title='Wonder Woman')
              and avg(rating) > 
               (select avg(rating) 
                 from movie, user, rating
                 where movie.title = 'Wonder Woman' and
                       userid = user.id and
                       movieid = movie.id)
             order by avg(rating) desc;
                      
+--------------------------------------------------+------+----------------+
| title                                            | year | average_rating |
+--------------------------------------------------+------+----------------+
| Beauty and the Beast                             | 2017 |         5.8391 |
| Dunkirk                                          | 2017 |         5.8046 |
| The LEGO Batman Movie                            | 2017 |         5.6605 |
| It                                               | 2017 |         5.6218 |
| Thor: Ragnarok                                   | 2017 |         5.5789 |
| Spider-Man: Homecoming                           | 2017 |         5.5705 |
| Guardians of the Galaxy Vol. 2                   | 2017 |         5.5263 |
| Logan                                            | 2017 |         5.5176 |
| Jumanji: Welcome to the Jungle                   | 2017 |         5.5083 |
| Coco                                             | 2017 |         5.5034 |
| Justice League                                   | 2017 |         5.4937 |
| The Greatest Showman                             | 2017 |         5.4867 |
| Kong: Skull Island                               | 2017 |         5.4224 |
| Get Out                                          | 2017 |         5.3899 |
| The Fate of the Furious                          | 2017 |         5.3580 |
| Despicable Me 3                                  | 2017 |         5.2746 |
| The Boss Baby                                    | 2017 |         5.2389 |
| Pirates of the Caribbean: Dead Men Tell No Tales | 2017 |         5.2357 |
+--------------------------------------------------+------+----------------+                   
</pre>
We don't need the year column since it's the same for all, and same as the release year of Wonder Woman.

<pre>
mysql> select title, avg(rating) as average_rating
             from movie, user, rating
             where userid=user.id 
                   and movieid=movie.id
                   and year(release_date) = 
                        (select year(release_date) from movie where title='Wonder Woman')
             group by title, year(release_date)
             having avg(rating) > 
               (select avg(rating) 
                 from movie, user, rating
                 where movie.title = 'Wonder Woman' and
                       userid = user.id and
                       movieid = movie.id)
             order by average_rating desc;
                      
+--------------------------------------------------+----------------+
| title                                            | average_rating |
+--------------------------------------------------+----------------+
| Beauty and the Beast                             |         5.8391 |
| Dunkirk                                          |         5.8046 |
| The LEGO Batman Movie                            |         5.6605 |
| It                                               |         5.6218 |
| Thor: Ragnarok                                   |         5.5789 |
| Spider-Man: Homecoming                           |         5.5705 |
| Guardians of the Galaxy Vol. 2                   |         5.5263 |
| Logan                                            |         5.5176 |
| Jumanji: Welcome to the Jungle                   |         5.5083 |
| Coco                                             |         5.5034 |
| Justice League                                   |         5.4937 |
| The Greatest Showman                             |         5.4867 |
| Kong: Skull Island                               |         5.4224 |
| Get Out                                          |         5.3899 |
| The Fate of the Furious                          |         5.3580 |
| Despicable Me 3                                  |         5.2746 |
| The Boss Baby                                    |         5.2389 |
| Pirates of the Caribbean: Dead Men Tell No Tales |         5.2357 |
+--------------------------------------------------+----------------+                
</pre>

Check the average rating for Wonder Woman:
<pre>
select avg(rating) 
    from movie, user, rating
    where movie.title = 'Wonder Woman' and
    userid = user.id and
    movieid = movie.id;
    
+-------------+
| avg(rating) |
+-------------+
|      5.1572 |
+-------------+   
</pre>